Revit 2027 API
BasicFileInfo.IsInProgress Property
 Checks if the file is workshared and is in process of becoming Central.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsInProgress { get; }
Public ReadOnly Property IsInProgress As Boolean
	Get
public:
property bool IsInProgress {
	bool get ();
}
member IsInProgress : bool with get
Property Value
Boolean
See Also
Reference
BasicFileInfo Class
Autodesk.Revit.DB Namespace